MorgothCreator/mSdk/SDK/platform/stm32f4xx/sys/Include/core_cm4.h
#define xPSR_C_Pos                         29                                             /*!< xPSR: C Position */
#define xPSR_C_Msk                         (1UL << xPSR_C_Pos)                            /*!< xPSR: C Mask */

#define xPSR_V_Pos                         28                                             /*!< xPSR: V Position */
#define xPSR_V_Msk                         (1UL << xPSR_V_Pos)                            /*!< xPSR: V Mask */

#define xPSR_Q_Pos                         27                                             /*!< xPSR: Q Position */
#define xPSR_Q_Msk                         (1UL << xPSR_Q_Pos)                            /*!< xPSR: Q Mask */

#define xPSR_IT_Pos                        25                                             /*!< xPSR: IT Position */
#define xPSR_IT_Msk                        (3UL << xPSR_IT_Pos)                           /*!< xPSR: IT Mask */

#define xPSR_T_Pos                         24                                             /*!< xPSR: T Position */
#define xPSR_T_Msk                         (1UL << xPSR_T_Pos)                            /*!< xPSR: T Mask */

#define xPSR_GE_Pos                        16                                             /*!< xPSR: GE Position */
#define xPSR_GE_Msk                        (0xFUL << xPSR_GE_Pos)                         /*!< xPSR: GE Mask */

#define xPSR_ISR_Pos                        0                                             /*!< xPSR: ISR Position */
#define xPSR_ISR_Msk                       (0x1FFUL /*<< xPSR_ISR_Pos*/)                  /*!< xPSR: ISR Mask */


/** \brief  Union type to access the Control Registers (CONTROL).
 */
typedef union
{
  struct
  {
    unsigned long nPRIV:1;                    /*!< bit:      0  Execution privilege in Thread mode */
    unsigned long SPSEL:1;                    /*!< bit:      1  Stack to be used                   */
    unsigned long FPCA:1;                     /*!< bit:      2  FP extension active flag           */
    unsigned long _reserved0:29;              /*!< bit:  3..31  Reserved                           */
  } b;                                   /*!< Structure used for bit  access                  */
  unsigned long w;                            /*!< Type      used for word access                  */
} CONTROL_Type;

/* CONTROL Register Definitions */
#define CONTROL_FPCA_Pos                    2                                             /*!< CONTROL: FPCA Position */
#define CONTROL_FPCA_Msk                   (1UL << CONTROL_FPCA_Pos)                      /*!< CONTROL: FPCA Mask */

#define CONTROL_SPSEL_Pos                   1                                             /*!< CONTROL: SPSEL Position */
#define CONTROL_SPSEL_Msk                  (1UL << CONTROL_SPSEL_Pos)                     /*!< CONTROL: SPSEL Mask */

#define CONTROL_nPRIV_Pos                   0                                             /*!< CONTROL: nPRIV Position */
#define CONTROL_nPRIV_Msk                  (1UL /*<< CONTROL_nPRIV_Pos*/)                 /*!< CONTROL: nPRIV Mask */

/*@} end of group CMSIS_CORE */


/** \ingroup    CMSIS_core_register
    \defgroup   CMSIS_NVIC  Nested Vectored Interrupt Controller (NVIC)
    \brief      Type definitions for the NVIC Registers
  @{
 */

/** \brief  Structure type to access the Nested Vectored Interrupt Controller (NVIC).
 */
typedef struct
{
  __IO unsigned long ISER[8];                 /*!< Offset: 0x000 (R/W)  Interrupt Set Enable Register           */
       unsigned long RESERVED0[24];
  __IO unsigned long ICER[8];                 /*!< Offset: 0x080 (R/W)  Interrupt Clear Enable Register         */
       unsigned long RSERVED1[24];
  __IO unsigned long ISPR[8];                 /*!< Offset: 0x100 (R/W)  Interrupt Set Pending Register          */
       unsigned long RESERVED2[24];
  __IO unsigned long ICPR[8];                 /*!< Offset: 0x180 (R/W)  Interrupt Clear Pending Register        */
       unsigned long RESERVED3[24];
  __IO unsigned long IABR[8];                 /*!< Offset: 0x200 (R/W)  Interrupt Active bit Register           */
       unsigned long RESERVED4[56];
  __IO unsigned char  IP[240];                 /*!< Offset: 0x300 (R/W)  Interrupt Priority Register (8Bit wide) */
       unsigned long RESERVED5[644];
  __O  unsigned long STIR;                    /*!< Offset: 0xE00 ( /W)  Software Trigger Interrupt Register     */
}  NVIC_Type;

/* Software Triggered Interrupt Register Definitions */
#define NVIC_STIR_INTID_Pos                 0                                          /*!< STIR: INTLINESNUM Position */
#define NVIC_STIR_INTID_Msk                (0x1FFUL /*<< NVIC_STIR_INTID_Pos*/)        /*!< STIR: INTLINESNUM Mask */

/*@} end of group CMSIS_NVIC */


/** \ingroup  CMSIS_core_register
    \defgroup CMSIS_SCB     System Control Block (SCB)
    \brief      Type definitions for the System Control Block Registers
  @{
 */

/** \brief  Structure type to access the System Control Block (SCB).
 */
typedef struct
{
  __I  unsigned long CPUID;                   /*!< Offset: 0x000 (R/ )  CPUID Base Register                                   */
  __IO unsigned long ICSR;                    /*!< Offset: 0x004 (R/W)  Interrupt Control and State Register                  */
  __IO unsigned long VTOR;                    /*!< Offset: 0x008 (R/W)  Vector Table Offset Register                          */
  __IO unsigned long AIRCR;                   /*!< Offset: 0x00C (R/W)  Application Interrupt and Reset Control Register      */
  __IO unsigned long SCR;                     /*!< Offset: 0x010 (R/W)  System Control Register                               */
  __IO unsigned long CCR;                     /*!< Offset: 0x014 (R/W)  Configuration Control Register                        */
  __IO unsigned char  SHP[12];                 /*!< Offset: 0x018 (R/W)  System Handlers Priority Registers (4-7, 8-11, 12-15) */
  __IO unsigned long SHCSR;                   /*!< Offset: 0x024 (R/W)  System Handler Control and State Register             */
  __IO unsigned long CFSR;                    /*!< Offset: 0x028 (R/W)  Configurable Fault Status Register                    */
  __IO unsigned long HFSR;                    /*!< Offset: 0x02C (R/W)  HardFault Status Register                             */
  __IO unsigned long DFSR;                    /*!< Offset: 0x030 (R/W)  Debug Fault Status Register                           */
  __IO unsigned long MMFAR;                   /*!< Offset: 0x034 (R/W)  MemManage Fault Address Register                      */
  __IO unsigned long BFAR;                    /*!< Offset: 0x038 (R/W)  BusFault Address Register                             */
  __IO unsigned long AFSR;                    /*!< Offset: 0x03C (R/W)  Auxiliary Fault Status Register                       */
  __I  unsigned long PFR[2];                  /*!< Offset: 0x040 (R/ )  Processor Feature Register                            */
  __I  unsigned long DFR;                     /*!< Offset: 0x048 (R/ )  Debug Feature Register                                */
  __I  unsigned long ADR;                     /*!< Offset: 0x04C (R/ )  Auxiliary Feature Register                            */
  __I  unsigned long MMFR[4];                 /*!< Offset: 0x050 (R/ )  Memory Model Feature Register                         */
  __I  unsigned long ISAR[5];                 /*!< Offset: 0x060 (R/ )  Instruction Set Attributes Register                   */
       unsigned long RESERVED0[5];
  __IO unsigned long CPACR;                   /*!< Offset: 0x088 (R/W)  Coprocessor Access Control Register                   */
} SCB_Type;

/* SCB CPUID Register Definitions */
#define SCB_CPUID_IMPLEMENTER_Pos          24                                             /*!< SCB CPUID: IMPLEMENTER Position */
#define SCB_CPUID_IMPLEMENTER_Msk          (0xFFUL << SCB_CPUID_IMPLEMENTER_Pos)          /*!< SCB CPUID: IMPLEMENTER Mask */

#define SCB_CPUID_VARIANT_Pos              20                                             /*!< SCB CPUID: VARIANT Position */
#define SCB_CPUID_VARIANT_Msk              (0xFUL << SCB_CPUID_VARIANT_Pos)               /*!< SCB CPUID: VARIANT Mask */

#define SCB_CPUID_ARCHITECTURE_Pos         16                                             /*!< SCB CPUID: ARCHITECTURE Position */
#define SCB_CPUID_ARCHITECTURE_Msk         (0xFUL << SCB_CPUID_ARCHITECTURE_Pos)          /*!< SCB CPUID: ARCHITECTURE Mask */

