MorgothCreator/mSdk/SDK/platform/stm32f4xx/sys/Include/core_cm4.h
    The function reads the pending register in the NVIC and returns the pending bit
    for the specified interrupt.

    \param [in]      IRQn  Interrupt number.

    \return             0  Interrupt status is not pending.
    \return             1  Interrupt status is pending.
 */
__STATIC_INLINE unsigned long NVIC_GetPendingIRQ(IRQn_Type IRQn)
{
  return((unsigned long)(((NVIC->ISPR[(((unsigned long)(signed long)IRQn) >> 5UL)] & (1UL << (((unsigned long)(signed long)IRQn) & 0x1FUL))) != 0UL) ? 1UL : 0UL));
}


/** \brief  Set Pending Interrupt

    The function sets the pending bit of an external interrupt.

    \param [in]      IRQn  Interrupt number. Value cannot be negative.
 */
__STATIC_INLINE void NVIC_SetPendingIRQ(IRQn_Type IRQn)
{
  NVIC->ISPR[(((unsigned long)(signed long)IRQn) >> 5UL)] = (unsigned long)(1UL << (((unsigned long)(signed long)IRQn) & 0x1FUL));
}


/** \brief  Clear Pending Interrupt

    The function clears the pending bit of an external interrupt.

    \param [in]      IRQn  External interrupt number. Value cannot be negative.
 */
__STATIC_INLINE void NVIC_ClearPendingIRQ(IRQn_Type IRQn)
{
  NVIC->ICPR[(((unsigned long)(signed long)IRQn) >> 5UL)] = (unsigned long)(1UL << (((unsigned long)(signed long)IRQn) & 0x1FUL));
}


/** \brief  Get Active Interrupt

    The function reads the active register in NVIC and returns the active bit.

    \param [in]      IRQn  Interrupt number.

    \return             0  Interrupt status is not active.
    \return             1  Interrupt status is active.
 */
__STATIC_INLINE unsigned long NVIC_GetActive(IRQn_Type IRQn)
{
  return((unsigned long)(((NVIC->IABR[(((unsigned long)(signed long)IRQn) >> 5UL)] & (1UL << (((unsigned long)(signed long)IRQn) & 0x1FUL))) != 0UL) ? 1UL : 0UL));
}


/** \brief  Set Interrupt Priority

    The function sets the priority of an interrupt.

    \note The priority cannot be set for every core interrupt.

    \param [in]      IRQn  Interrupt number.
    \param [in]  priority  Priority to set.
 */
__STATIC_INLINE void NVIC_SetPriority(IRQn_Type IRQn, unsigned long priority)
{
  if((signed long)IRQn < 0) {
    SCB->SHP[(((unsigned long)(signed long)IRQn) & 0xFUL)-4UL] = (unsigned char)((priority << (8 - __NVIC_PRIO_BITS)) & (unsigned long)0xFFUL);
  }
  else {
    NVIC->IP[((unsigned long)(signed long)IRQn)]               = (unsigned char)((priority << (8 - __NVIC_PRIO_BITS)) & (unsigned long)0xFFUL);
  }
}


/** \brief  Get Interrupt Priority

    The function reads the priority of an interrupt. The interrupt
    number can be positive to specify an external (device specific)
    interrupt, or negative to specify an internal (core) interrupt.


    \param [in]   IRQn  Interrupt number.
    \return             Interrupt Priority. Value is aligned automatically to the implemented
                        priority bits of the microcontroller.
 */
__STATIC_INLINE unsigned long NVIC_GetPriority(IRQn_Type IRQn)
{

  if((signed long)IRQn < 0) {
    return(((unsigned long)SCB->SHP[(((unsigned long)(signed long)IRQn) & 0xFUL)-4UL] >> (8 - __NVIC_PRIO_BITS)));
  }
  else {
    return(((unsigned long)NVIC->IP[((unsigned long)(signed long)IRQn)]               >> (8 - __NVIC_PRIO_BITS)));
  }
}


/** \brief  Encode Priority

    The function encodes the priority for an interrupt with the given priority group,
    preemptive priority value, and subpriority value.
    In case of a conflict between priority grouping and available
    priority bits (__NVIC_PRIO_BITS), the smallest possible priority group is set.

    \param [in]     PriorityGroup  Used priority group.
    \param [in]   PreemptPriority  Preemptive priority value (starting from 0).
    \param [in]       SubPriority  Subpriority value (starting from 0).
    \return                        Encoded priority. Value can be used in the function \ref NVIC_SetPriority().
 */
__STATIC_INLINE unsigned long NVIC_EncodePriority (unsigned long PriorityGroup, unsigned long PreemptPriority, unsigned long SubPriority)
{
  unsigned long PriorityGroupTmp = (PriorityGroup & (unsigned long)0x07UL);   /* only values 0..7 are used          */
  unsigned long PreemptPriorityBits;
  unsigned long SubPriorityBits;

  PreemptPriorityBits = ((7UL - PriorityGroupTmp) > (unsigned long)(__NVIC_PRIO_BITS)) ? (unsigned long)(__NVIC_PRIO_BITS) : (unsigned long)(7UL - PriorityGroupTmp);
  SubPriorityBits     = ((PriorityGroupTmp + (unsigned long)(__NVIC_PRIO_BITS)) < (unsigned long)7UL) ? (unsigned long)0UL : (unsigned long)((PriorityGroupTmp - 7UL) + (unsigned long)(__NVIC_PRIO_BITS));

  return (
           ((PreemptPriority & (unsigned long)((1UL << (PreemptPriorityBits)) - 1UL)) << SubPriorityBits) |
           ((SubPriority     & (unsigned long)((1UL << (SubPriorityBits    )) - 1UL)))
         );
}


/** \brief  Decode Priority

    The function decodes an interrupt priority value with a given priority group to
    preemptive priority value and subpriority value.
    In case of a conflict between priority grouping and available
    priority bits (__NVIC_PRIO_BITS) the smallest possible priority group is set.

    \param [in]         Priority   Priority value, which can be retrieved with the function \ref NVIC_GetPriority().
    \param [in]     PriorityGroup  Used priority group.
    \param [out] pPreemptPriority  Preemptive priority value (starting from 0).
    \param [out]     pSubPriority  Subpriority value (starting from 0).
 */
__STATIC_INLINE void NVIC_DecodePriority (unsigned long Priority, unsigned long PriorityGroup, unsigned long* pPreemptPriority, unsigned long* pSubPriority)
{
  unsigned long PriorityGroupTmp = (PriorityGroup & (unsigned long)0x07UL);   /* only values 0..7 are used          */
  unsigned long PreemptPriorityBits;
  unsigned long SubPriorityBits;

  PreemptPriorityBits = ((7UL - PriorityGroupTmp) > (unsigned long)(__NVIC_PRIO_BITS)) ? (unsigned long)(__NVIC_PRIO_BITS) : (unsigned long)(7UL - PriorityGroupTmp);
  SubPriorityBits     = ((PriorityGroupTmp + (unsigned long)(__NVIC_PRIO_BITS)) < (unsigned long)7UL) ? (unsigned long)0UL : (unsigned long)((PriorityGroupTmp - 7UL) + (unsigned long)(__NVIC_PRIO_BITS));

  *pPreemptPriority = (Priority >> SubPriorityBits) & (unsigned long)((1UL << (PreemptPriorityBits)) - 1UL);
  *pSubPriority     = (Priority                   ) & (unsigned long)((1UL << (SubPriorityBits    )) - 1UL);
}


/** \brief  System Reset

    The function initiates a system reset request to reset the MCU.
 */
__STATIC_INLINE void NVIC_SystemReset(void)
{
	__ASM volatile ("isb 0xF":::"memory");                                                         /* Ensure all outstanding memory accesses included
                                                                       buffered write are completed before reset */
  SCB->AIRCR  = (unsigned long)((0x5FAUL << SCB_AIRCR_VECTKEY_Pos)    |
                           (SCB->AIRCR & SCB_AIRCR_PRIGROUP_Msk) |
                            SCB_AIRCR_SYSRESETREQ_Msk    );         /* Keep priority group unchanged */
  __ASM volatile ("isb 0xF":::"memory");                                                         /* Ensure completion of memory access */
  while(1) { __ASM volatile ("nop"); }                                             /* wait until reset */
}

/*@} end of CMSIS_Core_NVICFunctions */



/* ##################################    SysTick function  ############################################ */
/** \ingroup  CMSIS_Core_FunctionInterface
    \defgroup CMSIS_Core_SysTickFunctions SysTick Functions
    \brief      Functions that configure the System.
  @{
 */

#if (__Vendor_SysTickConfig == 0)

/** \brief  System Tick Configuration

    The function initializes the System Timer and its interrupt, and starts the System Tick Timer.
    Counter is in free running mode to generate periodic interrupts.

    \param [in]  ticks  Number of ticks between two interrupts.

    \return          0  Function succeeded.
    \return          1  Function failed.

